; domain
(define (domain cooking)

    (:types ;
        movable location - object ; a manipulatable(movable) object
        workspace - location ; can be used for cutting
        container - movable ; something can be in a container
        veggie tool - movable ; objects that can be manipulated (pick/place/...)
        cuttool - tool ; tools that can cut
        gripper ; robotic gripper can hold objects
    )

    (:predicates ;
        ; General object predicates
        (is-sliced ?veg - veggie) ; True if veggie is sliced - observed predicate
        (available ?obj - movable) ; True is object is pickable - derived predicate
        (is-whole ?veg - veggie) ; True if veggie is intact - derived predicate

        ; Robot predicates
        (carry ?gripper - gripper ?obj - movable) ; - observed predicate
        (free ?gripper - gripper) ;  - derived predicate

        ; Location predicates
        (at ?obj - movable ?loc - location) ; True if ?obj is at ?loc - observed predicate
        (in ?obj - movable ?con - container) ; True if ?obj is in ?con - observed predicate
    )

    (:action pick
        :parameters (?bot - gripper ?obj - movable ?pick_loc - location)
        :precondition(
            and
            (available ?obj)
            (free ?bot)
            (at ?obj ?pick_loc)
        )
        :effect(
            and
            (not (available ?obj))
            (carry ?bot ?obj)
            (not (free ?bot))
            (not (at ?obj ?pick_loc))
        )
    )

    (:action place
        :parameters (?bot - gripper ?obj - movable ?place_loc - location)
        :precondition(
            and
            (carry ?bot ?obj)
            (not (free ?bot))
            (not (at ?obj ?place_loc))
        )
        :effect(
            and
            (available ?obj)
            (free ?bot)
            (at ?obj ?place_loc)
            (not (carry ?bot ?obj))
        )
    )

     (:action place_in
        :parameters (?bot - gripper ?obj - movable ?place_loc - container)
        :precondition(
            and
            (carry ?bot ?obj)
            (not (free ?bot))
            (not (in ?obj ?place_loc))
        )
        :effect(
            and
            (available ?obj)
            (free ?bot)
            (in ?obj ?place_loc)
            (not (carry ?bot ?obj))
        )
    )

    (:action slice
        :parameters (?bot - gripper ?veg - veggie ?cuttool - cuttool ?loc - workspace)
        :precondition(
            and
            (carry ?bot ?cuttool)
            (is-whole ?veg)
            (not (is-sliced ?veg))
            (at ?veg ?loc)
        )
        :effect(
            and
            (is-sliced ?veg)
            (not (is-whole ?veg))
        )
    )
  )

; problem
(define (problem cooking9)
(:domain cooking)
(:objects
    black_tray - location
    wooden_board - workspace
    bowl - container
    robotic_gripper - gripper
    robotic_gripper1 - gripper
    chopping_knife - cuttool
    vegetable - veggie
    vegetable1 - veggie
    vegetable2 - veggie
)
(:init
    ( at bowl black_tray )
    ( at vegetable wooden_board )
    ( at vegetable1 wooden_board )
    ( at vegetable2 black_tray )
    ( available bowl )
    ( available vegetable )
    ( available vegetable1 )
    ( available vegetable2 )
    ( carry robotic_gripper1 chopping_knife )
    ( free robotic_gripper )
    ( is-sliced vegetable )
    ( is-sliced vegetable1 )
    ( is-whole vegetable2 )
)

    (:goal
        (and
            (forall (?v - veggie) (in ?v bowl) )
            (forall (?v - veggie) (is-sliced ?v) )
        )
    )
)

; plan
1. (pick robotic_gripper vegetable wooden_board)
   deleted: (available vegetable) (free robotic_gripper) (at vegetable wooden_board)
   added: (carry robotic_gripper vegetable)
   goals met: 0 of 2
2. (place_in robotic_gripper vegetable bowl)
   deleted: (carry robotic_gripper vegetable)
   added: (available vegetable) (free robotic_gripper) (in vegetable bowl)
   goals met: 0 of 2
3. (pick robotic_gripper vegetable1 wooden_board)
   deleted: (available vegetable1) (free robotic_gripper) (at vegetable1 wooden_board)
   added: (carry robotic_gripper vegetable1)
   goals met: 0 of 2
4. (place_in robotic_gripper vegetable1 bowl)
   deleted: (carry robotic_gripper vegetable1)
   added: (available vegetable1) (free robotic_gripper) (in vegetable1 bowl)
   goals met: 0 of 2
5. (pick robotic_gripper vegetable2 black_tray)
   deleted: (available vegetable2) (free robotic_gripper) (at vegetable2 black_tray)
   added: (carry robotic_gripper vegetable2)
   goals met: 0 of 2
6. (place robotic_gripper vegetable2 wooden_board)
   deleted: (carry robotic_gripper vegetable2)
   added: (available vegetable2) (free robotic_gripper) (at vegetable2 wooden_board)
   goals met: 0 of 2
7. (slice robotic_gripper1 vegetable2 chopping_knife wooden_board)
   deleted: (is-whole vegetable2)
   added: (is-sliced vegetable2)
   goals met: 1 of 2
8. (pick robotic_gripper vegetable2 wooden_board)
   deleted: (available vegetable2) (free robotic_gripper) (at vegetable2 wooden_board)
   added: (carry robotic_gripper vegetable2)
   goals met: 1 of 2
9. (place_in robotic_gripper vegetable2 bowl)
   deleted: (carry robotic_gripper vegetable2)
   added: (available vegetable2) (free robotic_gripper) (in vegetable2 bowl)
   goals met: 2 of 2
